Enums/РегламентныеЗаданияРасширения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>РегламентныеЗаданияРасширения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗагрузкаВыписокИзКлиентБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассылкаОповещенийОСозданииДокументовНаЭлектроннуюПочту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ДополнительныеОтчетыИОбработки/Ext/Module.bsl
&Вместо("ВыполнитьОбработкуПоРегламентномуЗаданию")
Процедура УУ_ВыполнитьОбработкуПоРегламентномуЗаданию(ВнешняяОбработка, ИдентификаторКоманды)
	Если ТипЗнч(ИдентификаторКоманды) = Тип("ПеречислениеСсылка.РегламентныеЗаданияРасширения")  Тогда
		
		Если ИдентификаторКоманды = Перечисления.РегламентныеЗаданияРасширения.ЗагрузкаВыписокИзКлиентБанка тогда
			
			РегламентныеЗаданияРасширения.ВыполнитьРегламентнуюЗадачуЗагрузкаВыписокИзКлиентБанка();
			
		ИначеЕсли ИдентификаторКоманды = Перечисления.РегламентныеЗаданияРасширения.РассылкаОповещенийОСозданииДокументовНаЭлектроннуюПочту тогда
			
			РегламентныеЗаданияРасширения.ВыполнитьРегламентнуюЗадачуРассылкаОповещенийОСозданииДокументовНаЭлектроннуюПочту();
			
		КонецЕсли;
		
	Иначе
		
		ПродолжитьВызов(ВнешняяОбработка, ИдентификаторКоманды);
		
	КонецЕсли;
КонецПроцедуры
